Update design.md
